#include <iostream>

using namespace std;

int main()
{
    // Задача 1: За да не се бърка с ключовата дума "class" използвана за дефиране на класове.
    // Задача 2:
    /*
     а) тип "Т" не се използва
     b) два пъти е деклариран тип "Т"
     c) тип "Т2" не се използва
     */
    // Задача 3: Защото при инстанциране на клас те не се подразбират.
    // Задача 4: По това, че при шаблонните функции шаблонните параметри се подразбират (в повечето случаи)
    // Задача 5: Нетиповете параметри са тези, които вместо typename се използва конкретен тип
    // Задача 6: Като се подаде функция или функционален обект

    
}